{
  "founder_para_1": "is a results-driven talent acquisition leader with over a decade of experience in leadership & niche hiring, client servicing, and P&L management. He has been associated with Top Brands like Randstad, RGF & AMS in the leadership hiring and consulting space. He also has been with start-ups like Swiggy, Delhivery and REA India. As the Founder and Director of 10x Recruit, a pioneering recruitment company specializing in executive search and Mid-Senior hiring, he is passionate about connecting exceptional talent with top-tier organizations. ",
  "founder_para_2": "Josh thrives on the challenge of finding the perfect fit between talent and opportunity, helping businesses thrive and individuals achieve their career goals. In addition to his expertise in executive search, he has also excelled in corporate and RPO environments. This diverse background has equipped him with a comprehensive understanding of the recruitment landscape, enabling him to provide tailored solutions that meet the unique needs of each client. Under Josh's leadership, 10x Recruit is quickly become one of the most respected recruitment companies in the Mid-Senior to Leadership hiring space.",
  "founder_para_3": "",
  "cofounder_para_1": "is a seasoned maestro in the realms of sales and business development. He has carved out a dynamic career spanning diverse industries. From real estate, manufacturing, supply chain, and industrial development to food manufacturing, marketing services, seafood exports, corporate gifting, and the prestigious hospitality sector, Arun's journey has been illustrious.",
  "cofounder_para_2": "His path has seen him ascend to leadership roles, from manager to VP, COO, and CEO, underscoring his unwavering commitment to excellence and dedication. ",
  "cofounder_para_3": "What's even more noteworthy is Arun's educational background, encompassing degrees in mechanical engineering and an MBA, which have significantly enriched his multifaceted skill set. Today, as a co-founder, he leads the business development team at 10x Recruit, infusing it with a vision of sophistication and unwavering appeal, driving innovation and propelling the company to new heights.",
  "advisor_para_1": "is a highly skilled and experienced overseas recruitment consultant with a proven track record of success in placing candidates in top-tier positions across the globe. She has a deep understanding of the recruitment landscape and a passion for connecting talented individuals with the right opportunities.",
  "advisor_para_2": "Ananthi has a wealth of experience in the overseas recruitment industry, having worked with a wide range of clients, from small startups to large multinational corporations. She is adept at identifying and sourcing top talent, and she has a proven track record of closing deals. Ananthi is also a highly effective communicator and relationship builder. She is able to build rapport with candidates and clients alike.",
  "advisor_para_3": "",
  "search_partner_para_1": "is a dynamic and outcome-driven professional, boasting an impressive tenure of over 15 years in the realm of human resources and consulting. Her illustrious career has encompassed collaborations with organizations such as Zoom Developer, Prayas, ChildFund India, and SNC HR Solutions. Throughout her journey, she has undertaken diverse roles in Human Resources and Talent Acquisition accumulating a wealth of expertise and a multifaceted skill set. Presently, she is associated with 10X Recruit at a capacity of a Search Partner specializing in mid-senior to leadership hiring in the Non-Tech space.",
  "search_partner_para_2": "Beyond her professional accomplishments, Revathi K is deeply committed to making a positive impact on society. She actively engages as a dedicated social worker, exemplifying her passion for serving the differently-abled community. Her altruistic endeavors extend to her role as a Board Member of Azad Viklang Kalyan Samiti, Meghnagar, where she diligently contributes her insights and expertise to empower and uplift those in need.",
  "search_partner_para_3": ""
}
